```
# google_compute_global_address.jade-initials-ip["nm"] will be created
  + resource "google_compute_global_address" "jade-initials-ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "jade-dev-nm"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_project_iam_member.user-sql-sa-role["nm"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-dev"
      + role    = "roles/cloudsql.client"
    }

  # google_service_account.user-sql-service-account["nm"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "nm-proxy-sa"
      + display_name = "sqlproxy service account for nm namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["nm"] will be created
  + resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:broad-jade-dev.svc.id.goog[nm/nm-jade-gcloud-sqlproxy]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["nm"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }
# google_sql_database.jade-datarepo-initials-db["nm"] will be created
  + resource "google_sql_database" "jade-datarepo-initials-db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "jade-postgres-101-987f0c3b501aeabf"
      + name      = "datarepo-nm"
      + project   = "broad-jade-dev"
      + self_link = (known after apply)
    }

  # google_sql_database.jade-datarepo-initials-db-11["nm"] will be created
  + resource "google_sql_database" "jade-datarepo-initials-db-11" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "jade-postgres-11-8a00fd4d3b"
      + name      = "datarepo-nm"
      + project   = "broad-jade-dev"
      + self_link = (known after apply)
    }

  # google_sql_database.jade-stairway-initials-db["nm"] will be created
  + resource "google_sql_database" "jade-stairway-initials-db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "jade-postgres-101-987f0c3b501aeabf"
      + name      = "stairway-nm"
      + project   = "broad-jade-dev"
      + self_link = (known after apply)
    }

  # google_sql_database.jade-stairway-initials-db-11["nm"] will be created
  + resource "google_sql_database" "jade-stairway-initials-db-11" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "jade-postgres-11-8a00fd4d3b"
      + name      = "stairway-nm"
      + project   = "broad-jade-dev"
      + self_link = (known after apply)
    }

  # module.initials-dns-set.google_dns_record_set.set_dns_record["jade-global-nm"] will be created
  + resource "google_dns_record_set" "set_dns_record" {
      + id           = (known after apply)
      + managed_zone = "datarepo-dev"
      + name         = "jade-global-nm.datarepo-dev.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

# module.initials-dns-set.google_dns_record_set.set_dns_record["jade-nm"] will be created
  + resource "google_dns_record_set" "set_dns_record" {
      + id           = (known after apply)
      + managed_zone = "datarepo-dev"
      + name         = "jade-nm.datarepo-dev.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = [
          + "jade-global-nm.datarepo-dev.broadinstitute.org.",
        ]
      + ttl          = 300
      + type         = "CNAME"
    }

```

LGTM heres the plan since its not automated for dev anymore. 